[Killed] BlockStatement
hello/src/lib/hello.ts:2:33
 // © Sitecore Corporation A/S. All rights reserved. Sitecore® is a registered trademark of Sitecore Corporation A/S.
-export function hello(): string {
-  return 'hello';
-}
+export function hello(): string {}
 
killedBy: hello should work
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "hello"
Received: undefined

[Killed] StringLiteral
hello/src/lib/hello.ts:3:10
 // © Sitecore Corporation A/S. All rights reserved. Sitecore® is a registered trademark of Sitecore Corporation A/S.
 export function hello(): string {
-  return 'hello';
+  return "";
 }
 
killedBy: hello should work
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "hello"
Received: ""
