[Killed] ConditionalExpression
src/lib/converters/base-64-converter.ts:9:16
  * @returns A base64 string
  */
 export function convertToBase64(input: string | { [key: string]: unknown }): string {
-  const data = typeof input === 'string' ? input : JSON.stringify(input);
+  const data = true ? input : JSON.stringify(input);
 
   const stringFormat = 'base64';
killedBy: convertToBase64 converts an object to base64 when Buffer is not present
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "eyJmb28iOiJiYXIifQ=="
Received: "W29iamVjdCBPYmplY3Rd"

[Killed] ConditionalExpression
src/lib/converters/base-64-converter.ts:9:16
  * @returns A base64 string
  */
 export function convertToBase64(input: string | { [key: string]: unknown }): string {
-  const data = typeof input === 'string' ? input : JSON.stringify(input);
+  const data = false ? input : JSON.stringify(input);
 
   const stringFormat = 'base64';
killedBy: convertToBase64 converts a string to base64
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Zm9v"
Received: "ImZvbyI="

[Killed] ConditionalExpression
src/lib/converters/base-64-converter.ts:12:7
   const data = typeof input === 'string' ? input : JSON.stringify(input);
 
   const stringFormat = 'base64';
-  if (typeof Buffer === 'function') return Buffer.from(data).toString(stringFormat);
+  if (true) return Buffer.from(data).toString(stringFormat);
 
   if (typeof window?.btoa === 'function') return window.btoa(data);
killedBy: convertToBase64 converts a string to base64
statusReason: TypeError: Cannot read properties of undefined (reading 'from')

[Killed] EqualityOperator
src/lib/converters/base-64-converter.ts:14:7
   const stringFormat = 'base64';
   if (typeof Buffer === 'function') return Buffer.from(data).toString(stringFormat);
 
-  if (typeof window?.btoa === 'function') return window.btoa(data);
+  if (typeof window?.btoa !== 'function') return window.btoa(data);
 
   return data;
killedBy: convertToBase64 converts a string to base64
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Zm9v"
Received: "foo"

[Killed] OptionalChaining
src/lib/converters/base-64-converter.ts:14:14
   const stringFormat = 'base64';
   if (typeof Buffer === 'function') return Buffer.from(data).toString(stringFormat);
 
-  if (typeof window?.btoa === 'function') return window.btoa(data);
+  if (typeof window.btoa === 'function') return window.btoa(data);
 
   return data;
killedBy: convertToBase64 Returns the object as stringify if Buffer and Window are not present 
statusReason: TypeError: Cannot read properties of undefined (reading 'btoa')
