[Killed] BlockStatement
src/lib/converters/flatten-object.ts:17:67
  * // flattenedObject will be {order_amount: 1, order_delivered: false}
  * ```
  */
-export function flattenObject(data: IFlattenObjectDataParameters) {
-  const { currentKey, object } = data;
-  const newObject = data.newObject ?? {};
-
-  for (const key in object) {
-    const value = object[key];
-
-    if (value === undefined) continue;
-
-    if (typeof value === 'object' && !Array.isArray(value))
-      flattenObject({
-        currentKey: `${currentKey ? `${currentKey}_${key}` : key}`,
-        newObject,
-        object: value,
-      });
-    else newObject[currentKey ? `${currentKey}_${key}` : key] = value;
-  }
-
-  return newObject;
-}
+export function flattenObject(data: IFlattenObjectDataParameters) {}
 
 /**
killedBy: flattenObject should return a properly flattened object
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"a": "a", "b": true, "c": 11, "e_f": "f", "e_g": false, "e_h": 22, "e_i": ["a", 2, true, {"a": "a"}, [[1], [2]]], "e_j_k": "k", "n": ""}
Received: undefined

[Killed] LogicalOperator
src/lib/converters/flatten-object.ts:19:21
  */
 export function flattenObject(data: IFlattenObjectDataParameters) {
   const { currentKey, object } = data;
-  const newObject = data.newObject ?? {};
+  const newObject = data.newObject && {};
 
   for (const key in object) {
killedBy: flattenObject should return a properly flattened object
statusReason: TypeError: Cannot set properties of undefined (setting 'a')

[Killed] BlockStatement
src/lib/converters/flatten-object.ts:21:29
   const { currentKey, object } = data;
   const newObject = data.newObject ?? {};
 
-  for (const key in object) {
-    const value = object[key];
-
-    if (value === undefined) continue;
-
-    if (typeof value === 'object' && !Array.isArray(value))
-      flattenObject({
-        currentKey: `${currentKey ? `${currentKey}_${key}` : key}`,
-        newObject,
-        object: value,
-      });
-    else newObject[currentKey ? `${currentKey}_${key}` : key] = value;
-  }
+  for (const key in object) {}
 
   return newObject;
killedBy: flattenObject should return a properly flattened object
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 26
+ Received  +  1

- Object {
-   "a": "a",
-   "b": true,

[Killed] ConditionalExpression
src/lib/converters/flatten-object.ts:24:9
   for (const key in object) {
     const value = object[key];
 
-    if (value === undefined) continue;
+    if (true) continue;
 
     if (typeof value === 'object' && !Array.isArray(value))
killedBy: flattenObject should return a properly flattened object
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 26
+ Received  +  1

- Object {
-   "a": "a",
-   "b": true,

[Killed] ConditionalExpression
src/lib/converters/flatten-object.ts:24:9
   for (const key in object) {
     const value = object[key];
 
-    if (value === undefined) continue;
+    if (false) continue;
 
     if (typeof value === 'object' && !Array.isArray(value))
killedBy: flattenObject should not add a property if property is undefined
statusReason: Error: expect(received).not.toHaveProperty(path)

Expected path: not "a"

Received value: undefined

[Killed] ConditionalExpression
src/lib/converters/flatten-object.ts:26:9
 
     if (value === undefined) continue;
 
-    if (typeof value === 'object' && !Array.isArray(value))
+    if (false)
       flattenObject({
         currentKey: `${currentKey ? `${currentKey}_${key}` : key}`,
killedBy: flattenObject should return a properly flattened object
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  -  5
+ Received  + 10

@@ -1,13 +1,14 @@
  Object {
    "a": "a",

[Killed] BooleanLiteral
src/lib/converters/flatten-object.ts:26:38
 
     if (value === undefined) continue;
 
-    if (typeof value === 'object' && !Array.isArray(value))
+    if (typeof value === 'object' && Array.isArray(value))
       flattenObject({
         currentKey: `${currentKey ? `${currentKey}_${key}` : key}`,
killedBy: flattenObject should return a properly flattened object
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  -  5
+ Received  + 10

@@ -1,13 +1,14 @@
  Object {
    "a": "a",

[Killed] StringLiteral
src/lib/converters/flatten-object.ts:32:33
         newObject,
         object: value,
       });
-    else newObject[currentKey ? `${currentKey}_${key}` : key] = value;
+    else newObject[currentKey ? `` : key] = value;
   }
 
killedBy: flattenObject should return a properly flattened object
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 20
+ Received  +  1

  Object {
+   "": "k",
    "a": "a",
