[Killed] BlockStatement
src/lib/cookies/cookie-exists-in-server-side.ts:11:94
  * @param cookieName - The cookie name to be found
  * @returns - A boolean value if cookie exists
  */
-export function cookieExistsInServerSide(cookiesHeader: string, cookieName: string): boolean {
-  return getCookieServerSide(cookiesHeader, cookieName) !== undefined;
-}
+export function cookieExistsInServerSide(cookiesHeader: string, cookieName: string): boolean {}
 
killedBy: cookieExistsInServerSide Returns true if cookie exists in the cookie header
statusReason: Error: expect(received).toBeTruthy()

Received: undefined

[Killed] ConditionalExpression
src/lib/cookies/cookie-exists-in-server-side.ts:12:10
  * @returns - A boolean value if cookie exists
  */
 export function cookieExistsInServerSide(cookiesHeader: string, cookieName: string): boolean {
-  return getCookieServerSide(cookiesHeader, cookieName) !== undefined;
+  return false;
 }
 
killedBy: cookieExistsInServerSide Returns true if cookie exists in the cookie header
statusReason: Error: expect(received).toBeTruthy()

Received: false

[Killed] ConditionalExpression
src/lib/cookies/cookie-exists-in-server-side.ts:12:10
  * @returns - A boolean value if cookie exists
  */
 export function cookieExistsInServerSide(cookiesHeader: string, cookieName: string): boolean {
-  return getCookieServerSide(cookiesHeader, cookieName) !== undefined;
+  return true;
 }
 
killedBy: cookieExistsInServerSide Returns false if there is no cookie in the header
statusReason: Error: expect(received).toBeFalsy()

Received: true
