[Killed] BlockStatement
src/lib/cookies/cookie-exists.ts:9:78
  * @param cookieName - The cookie name to be found
  * @returns - boolean value, if the cookie is found in the cookie string
  */
-export function cookieExists(cookieStr: string, cookieName: string): boolean {
-  return cookieStr.split('; ').some((cookie: string) => cookie.split('=')[0] === cookieName);
-}
+export function cookieExists(cookieStr: string, cookieName: string): boolean {}
 
killedBy: cookieExists should accept a cookie string and a cookie name as parameters and return a cookie string if the cookie name is found in the cookie string
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: undefined

[Killed] ArrowFunction
src/lib/cookies/cookie-exists.ts:10:37
  * @returns - boolean value, if the cookie is found in the cookie string
  */
 export function cookieExists(cookieStr: string, cookieName: string): boolean {
-  return cookieStr.split('; ').some((cookie: string) => cookie.split('=')[0] === cookieName);
+  return cookieStr.split('; ').some(() => undefined);
 }
 
killedBy: cookieExists should accept a cookie string and a cookie name as parameters and return a cookie string if the cookie name is found in the cookie string
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] MethodExpression
src/lib/cookies/cookie-exists.ts:10:10
  * @returns - boolean value, if the cookie is found in the cookie string
  */
 export function cookieExists(cookieStr: string, cookieName: string): boolean {
-  return cookieStr.split('; ').some((cookie: string) => cookie.split('=')[0] === cookieName);
+  return cookieStr.split('; ').every((cookie: string) => cookie.split('=')[0] === cookieName);
 }
 
killedBy: cookieExists should return true if document cookie string contains the cookie name
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false
