[Killed] BlockStatement
src/lib/cookies/create-cookie-string.ts:12:104
  * @param attributes - an object of supported cookie attributes
  * @returns - a string that will be passed to document.cookie
  */
-export function createCookieString(name: string, value: string, attributes: ICookieProperties): string {
-  let cookieString = `${name}=${value};`;
-
-  cookieString += ` Max-Age=${attributes.maxAge}; SameSite=${attributes.sameSite};`;
-  cookieString += attributes.secure ? ' Secure;' : '';
-  cookieString += attributes.path ? ` Path=${attributes.path};` : '';
-  cookieString += attributes.domain ? ` Domain=${attributes.domain};` : '';
-
-  cookieString = cookieString.substring(0, cookieString.length - 1);
-
-  return cookieString;
-}
+export function createCookieString(name: string, value: string, attributes: ICookieProperties): string {}
 
killedBy: createCookieString should produce and return a string with provided parameters No SameSite no Security
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "cookieName=cookieValue; Max-Age=31536000; SameSite=None"
Received: undefined

[Killed] StringLiteral
src/lib/cookies/create-cookie-string.ts:13:22
  * @returns - a string that will be passed to document.cookie
  */
 export function createCookieString(name: string, value: string, attributes: ICookieProperties): string {
-  let cookieString = `${name}=${value};`;
+  let cookieString = ``;
 
   cookieString += ` Max-Age=${attributes.maxAge}; SameSite=${attributes.sameSite};`;
killedBy: createCookieString should produce and return a string with provided parameters No SameSite no Security
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "cookieName=cookieValue; Max-Age=31536000; SameSite=None"
Received: " Max-Age=31536000; SameSite=None"

[Killed] AssignmentOperator
src/lib/cookies/create-cookie-string.ts:16:3
   let cookieString = `${name}=${value};`;
 
   cookieString += ` Max-Age=${attributes.maxAge}; SameSite=${attributes.sameSite};`;
-  cookieString += attributes.secure ? ' Secure;' : '';
+  cookieString -= attributes.secure ? ' Secure;' : '';
   cookieString += attributes.path ? ` Path=${attributes.path};` : '';
   cookieString += attributes.domain ? ` Domain=${attributes.domain};` : '';
killedBy: createCookieString should produce and return a string with provided parameters No SameSite no Security
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "cookieName=cookieValue; Max-Age=31536000; SameSite=None"
Received: "Na"

[Killed] StringLiteral
src/lib/cookies/create-cookie-string.ts:16:52
   let cookieString = `${name}=${value};`;
 
   cookieString += ` Max-Age=${attributes.maxAge}; SameSite=${attributes.sameSite};`;
-  cookieString += attributes.secure ? ' Secure;' : '';
+  cookieString += attributes.secure ? ' Secure;' : "Stryker was here!";
   cookieString += attributes.path ? ` Path=${attributes.path};` : '';
   cookieString += attributes.domain ? ` Domain=${attributes.domain};` : '';
killedBy: createCookieString should produce and return a string with provided parameters No SameSite no Security
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "cookieName=cookieValue; Max-Age=31536000; SameSite=None"
Received: "cookieName=cookieValue; Max-Age=31536000; SameSite=None;Stryker was here"

[Killed] AssignmentOperator
src/lib/cookies/create-cookie-string.ts:17:3
 
   cookieString += ` Max-Age=${attributes.maxAge}; SameSite=${attributes.sameSite};`;
   cookieString += attributes.secure ? ' Secure;' : '';
-  cookieString += attributes.path ? ` Path=${attributes.path};` : '';
+  cookieString -= attributes.path ? ` Path=${attributes.path};` : '';
   cookieString += attributes.domain ? ` Domain=${attributes.domain};` : '';
 
killedBy: createCookieString should produce and return a string with provided parameters No SameSite no Security
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "cookieName=cookieValue; Max-Age=31536000; SameSite=None"
Received: "Na"

[Killed] StringLiteral
src/lib/cookies/create-cookie-string.ts:17:67
 
   cookieString += ` Max-Age=${attributes.maxAge}; SameSite=${attributes.sameSite};`;
   cookieString += attributes.secure ? ' Secure;' : '';
-  cookieString += attributes.path ? ` Path=${attributes.path};` : '';
+  cookieString += attributes.path ? ` Path=${attributes.path};` : "Stryker was here!";
   cookieString += attributes.domain ? ` Domain=${attributes.domain};` : '';
 
killedBy: createCookieString should produce and return a string with provided parameters No SameSite no Security
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "cookieName=cookieValue; Max-Age=31536000; SameSite=None"
Received: "cookieName=cookieValue; Max-Age=31536000; SameSite=None;Stryker was here"

[Killed] AssignmentOperator
src/lib/cookies/create-cookie-string.ts:18:3
   cookieString += ` Max-Age=${attributes.maxAge}; SameSite=${attributes.sameSite};`;
   cookieString += attributes.secure ? ' Secure;' : '';
   cookieString += attributes.path ? ` Path=${attributes.path};` : '';
-  cookieString += attributes.domain ? ` Domain=${attributes.domain};` : '';
+  cookieString -= attributes.domain ? ` Domain=${attributes.domain};` : '';
 
   cookieString = cookieString.substring(0, cookieString.length - 1);
killedBy: createCookieString should produce and return a string with provided parameters No SameSite no Security
statusReason: TypeError: cookieString.substring is not a function

[Killed] StringLiteral
src/lib/cookies/create-cookie-string.ts:18:73
   cookieString += ` Max-Age=${attributes.maxAge}; SameSite=${attributes.sameSite};`;
   cookieString += attributes.secure ? ' Secure;' : '';
   cookieString += attributes.path ? ` Path=${attributes.path};` : '';
-  cookieString += attributes.domain ? ` Domain=${attributes.domain};` : '';
+  cookieString += attributes.domain ? ` Domain=${attributes.domain};` : "Stryker was here!";
 
   cookieString = cookieString.substring(0, cookieString.length - 1);
killedBy: createCookieString should produce and return a string with provided parameters No SameSite no Security
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "cookieName=cookieValue; Max-Age=31536000; SameSite=None"
Received: "cookieName=cookieValue; Max-Age=31536000; SameSite=None;Stryker was here"

[Killed] ArithmeticOperator
src/lib/cookies/create-cookie-string.ts:20:44
   cookieString += attributes.path ? ` Path=${attributes.path};` : '';
   cookieString += attributes.domain ? ` Domain=${attributes.domain};` : '';
 
-  cookieString = cookieString.substring(0, cookieString.length - 1);
+  cookieString = cookieString.substring(0, cookieString.length + 1);
 
   return cookieString;
killedBy: createCookieString should produce and return a string with provided parameters No SameSite no Security
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "cookieName=cookieValue; Max-Age=31536000; SameSite=None"
Received: "cookieName=cookieValue; Max-Age=31536000; SameSite=None;"

[Killed] MethodExpression
src/lib/cookies/create-cookie-string.ts:20:18
   cookieString += attributes.path ? ` Path=${attributes.path};` : '';
   cookieString += attributes.domain ? ` Domain=${attributes.domain};` : '';
 
-  cookieString = cookieString.substring(0, cookieString.length - 1);
+  cookieString = cookieString;
 
   return cookieString;
killedBy: createCookieString should produce and return a string with provided parameters No SameSite no Security
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "cookieName=cookieValue; Max-Age=31536000; SameSite=None"
Received: "cookieName=cookieValue; Max-Age=31536000; SameSite=None;"
