[Killed] BlockStatement
src/lib/cookies/delete-cookie.ts:7:56
  * Deletes a cookie from the document (client-side only)
  * @param cookieName - The cookie to be deleted
  */
-export function deleteCookie(cookieName: string): void {
-  document.cookie = cookieName + '=; Path=/; Expires=Thu, 01 Jan 1970 00:00:01 GMT;';
-}
+export function deleteCookie(cookieName: string): void {}
 
killedBy: deleteCookie should delete a cookie from the document.cookie object
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: ""
Received: "testCookie=testValue"

[Killed] StringLiteral
src/lib/cookies/delete-cookie.ts:8:34
  * @param cookieName - The cookie to be deleted
  */
 export function deleteCookie(cookieName: string): void {
-  document.cookie = cookieName + '=; Path=/; Expires=Thu, 01 Jan 1970 00:00:01 GMT;';
+  document.cookie = cookieName + "";
 }
 
killedBy: deleteCookie should delete a cookie from the document.cookie object
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: ""
Received: "testCookie=testValue; testCookie"
