[Killed] BlockStatement
src/lib/cookies/get-cookie-server-side.ts:14:48
 export function getCookieServerSide(
   cookiesHeader: string | undefined,
   cookieName: string
-): { name: string; value: string } | undefined {
-  return getCookie(cookiesHeader, cookieName);
-}
+): { name: string; value: string } | undefined {}
 
killedBy: getCookieServerSide Returns the specific cookie when cookie is set with specific name & value
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "testCookie"
Received: undefined
