[Killed] BlockStatement
src/lib/cookies/get-cookie-value-client-side.ts:9:70
  * @param cookieName - The cookie name to be found
  * @returns - The value of the cookie if it exists or empty string
  */
-export function getCookieValueClientSide(cookieName: string): string {
-  const cookie = getCookie(document.cookie, cookieName);
-
-  return cookie?.value ?? '';
-}
+export function getCookieValueClientSide(cookieName: string): string {}
 
killedBy: getCookieValue should return the cookie value for a given cookie name
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "testCookieValue"
Received: undefined

[Killed] LogicalOperator
src/lib/cookies/get-cookie-value-client-side.ts:12:10
 export function getCookieValueClientSide(cookieName: string): string {
   const cookie = getCookie(document.cookie, cookieName);
 
-  return cookie?.value ?? '';
+  return cookie?.value && '';
 }
 
killedBy: getCookieValue should return the cookie value for a given cookie name
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "testCookieValue"
Received: ""

[Killed] OptionalChaining
src/lib/cookies/get-cookie-value-client-side.ts:12:10
 export function getCookieValueClientSide(cookieName: string): string {
   const cookie = getCookie(document.cookie, cookieName);
 
-  return cookie?.value ?? '';
+  return cookie.value ?? '';
 }
 
killedBy: getCookieValue should return an empty string if the cookie name is not found
statusReason: TypeError: Cannot read properties of undefined (reading 'value')
