[Killed] BlockStatement
src/lib/cookies/get-cookie.ts:12:48
 export function getCookie(
   cookieStr: string | undefined,
   cookieName: string
-): { name: string; value: string } | undefined {
-  if (!cookieStr) return undefined;
-
-  const found = cookieStr.split('; ').find((cookie: string) => {
-    return cookie.indexOf('=') > 0 && cookie.split('=')[0] === cookieName;
-  });
-
-  return found !== undefined ? { name: found.split('=')[0], value: found.split('=')[1] } : undefined;
-}
+): { name: string; value: string } | undefined {}
 
killedBy: getCookie should accept a cookie string and a cookie name as parameters and return a cookie object if the cookie name is found in the cookie string
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"name": "cookieName", "value": "cookieValue"}
Received: undefined

[Killed] ConditionalExpression
src/lib/cookies/get-cookie.ts:13:7
   cookieStr: string | undefined,
   cookieName: string
 ): { name: string; value: string } | undefined {
-  if (!cookieStr) return undefined;
+  if (true) return undefined;
 
   const found = cookieStr.split('; ').find((cookie: string) => {
killedBy: getCookie should accept a cookie string and a cookie name as parameters and return a cookie object if the cookie name is found in the cookie string
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"name": "cookieName", "value": "cookieValue"}
Received: undefined

[Killed] ConditionalExpression
src/lib/cookies/get-cookie.ts:13:7
   cookieStr: string | undefined,
   cookieName: string
 ): { name: string; value: string } | undefined {
-  if (!cookieStr) return undefined;
+  if (false) return undefined;
 
   const found = cookieStr.split('; ').find((cookie: string) => {
killedBy: getCookie should return undefined if the parameter value for cookie string is also undefined
statusReason: TypeError: Cannot read properties of undefined (reading 'split')

[Killed] BlockStatement
src/lib/cookies/get-cookie.ts:15:64
 ): { name: string; value: string } | undefined {
   if (!cookieStr) return undefined;
 
-  const found = cookieStr.split('; ').find((cookie: string) => {
-    return cookie.indexOf('=') > 0 && cookie.split('=')[0] === cookieName;
-  });
+  const found = cookieStr.split('; ').find((cookie: string) => {});
 
   return found !== undefined ? { name: found.split('=')[0], value: found.split('=')[1] } : undefined;
killedBy: getCookie should accept a cookie string and a cookie name as parameters and return a cookie object if the cookie name is found in the cookie string
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"name": "cookieName", "value": "cookieValue"}
Received: undefined

[Killed] EqualityOperator
src/lib/cookies/get-cookie.ts:16:12
   if (!cookieStr) return undefined;
 
   const found = cookieStr.split('; ').find((cookie: string) => {
-    return cookie.indexOf('=') > 0 && cookie.split('=')[0] === cookieName;
+    return cookie.indexOf('=') <= 0 && cookie.split('=')[0] === cookieName;
   });
 
killedBy: getCookieValue should return the cookie value for a given cookie name
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "testCookieValue"
Received: ""

[Killed] ConditionalExpression
src/lib/cookies/get-cookie.ts:16:39
   if (!cookieStr) return undefined;
 
   const found = cookieStr.split('; ').find((cookie: string) => {
-    return cookie.indexOf('=') > 0 && cookie.split('=')[0] === cookieName;
+    return cookie.indexOf('=') > 0 && true;
   });
 
killedBy: getCookie should return undefined if the cookie name is not found inside the cookie string
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: undefined
Received: {"name": "cookieName2", "value": "cookieValue2"}

[Killed] ConditionalExpression
src/lib/cookies/get-cookie.ts:19:10
     return cookie.indexOf('=') > 0 && cookie.split('=')[0] === cookieName;
   });
 
-  return found !== undefined ? { name: found.split('=')[0], value: found.split('=')[1] } : undefined;
+  return true ? { name: found.split('=')[0], value: found.split('=')[1] } : undefined;
 }
 
killedBy: getCookie should return undefined if the cookie name is not found inside the cookie string
statusReason: TypeError: Cannot read properties of undefined (reading 'split')

[Killed] EqualityOperator
src/lib/cookies/get-cookie.ts:19:10
     return cookie.indexOf('=') > 0 && cookie.split('=')[0] === cookieName;
   });
 
-  return found !== undefined ? { name: found.split('=')[0], value: found.split('=')[1] } : undefined;
+  return found === undefined ? { name: found.split('=')[0], value: found.split('=')[1] } : undefined;
 }
 
killedBy: getCookie should accept a cookie string and a cookie name as parameters and return a cookie object if the cookie name is found in the cookie string
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"name": "cookieName", "value": "cookieValue"}
Received: undefined
