[Killed] BlockStatement
src/lib/typeguards/is-http-request.ts:13:75
  * @returns Returns true if 'request' is a valid HTTP Request, otherwise false.
  */
 
-export function isHttpRequest(request: TRequest): request is IHttpRequest {
-  return 'headers' in request;
-}
+export function isHttpRequest(request: TRequest): request is IHttpRequest {}
 
killedBy: isHttpRequest should return true for a valid HTTP Request
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: undefined
