[Killed] BlockStatement
src/lib/typeguards/is-http-response.ts:12:110
  * @param response - IMiddlewareNextResponse | IHttpResponse - The response object to be validated.
  * @returns Returns true if 'response' is a valid HTTP Response, otherwise false.
  */
-export function isHttpResponse(response: IMiddlewareNextResponse | IHttpResponse): response is IHttpResponse {
-  return 'setHeader' in response;
-}
+export function isHttpResponse(response: IMiddlewareNextResponse | IHttpResponse): response is IHttpResponse {}
 
killedBy: isHttpResponse should return true if response has Http Response properties
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: undefined

[Killed] StringLiteral
src/lib/typeguards/is-http-response.ts:13:10
  * @returns Returns true if 'response' is a valid HTTP Response, otherwise false.
  */
 export function isHttpResponse(response: IMiddlewareNextResponse | IHttpResponse): response is IHttpResponse {
-  return 'setHeader' in response;
+  return "" in response;
 }
 
killedBy: isHttpResponse should return true if response has Http Response properties
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false
