[Killed] BlockStatement
src/lib/typeguards/is-next-js-middleware-request.ts:12:93
  * @param request - The request object to be validated.
  * @returns Returns true if 'request' is a valid Middleware Request, otherwise false.
  */
-export function isNextJsMiddlewareRequest(request: TRequest): request is IMiddlewareRequest {
-  return 'cookies' in request && 'get' in request.cookies && 'set' in request.cookies;
-}
+export function isNextJsMiddlewareRequest(request: TRequest): request is IMiddlewareRequest {}
 
killedBy: handleServerCookie should not call handleNextJsMiddlewareCookie or handleHttpCookie
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] LogicalOperator
src/lib/typeguards/is-next-js-middleware-request.ts:13:10
  * @returns Returns true if 'request' is a valid Middleware Request, otherwise false.
  */
 export function isNextJsMiddlewareRequest(request: TRequest): request is IMiddlewareRequest {
-  return 'cookies' in request && 'get' in request.cookies && 'set' in request.cookies;
+  return 'cookies' in request && 'get' in request.cookies || 'set' in request.cookies;
 }
 
killedBy: isNextJsMiddlewareRequest should return false for an object without cookies
statusReason: TypeError: Cannot use 'in' operator to search for 'set' in undefined

[Killed] ConditionalExpression
src/lib/typeguards/is-next-js-middleware-request.ts:13:10
  * @returns Returns true if 'request' is a valid Middleware Request, otherwise false.
  */
 export function isNextJsMiddlewareRequest(request: TRequest): request is IMiddlewareRequest {
-  return 'cookies' in request && 'get' in request.cookies && 'set' in request.cookies;
+  return false;
 }
 
killedBy: handleServerCookie should not call handleNextJsMiddlewareCookie or handleHttpCookie
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0
