[Killed] BlockStatement
src/lib/typeguards/is-next-js-middleware-response.ts:14:40
  */
 export function isNextJsMiddlewareResponse(
   response: IMiddlewareNextResponse | IHttpResponse
-): response is IMiddlewareNextResponse {
-  return 'cookies' in response && 'set' in response.cookies;
-}
+): response is IMiddlewareNextResponse {}
 
killedBy: handleServerCookie should not call handleNextJsMiddlewareCookie or handleHttpCookie
statusReason: Error: expect(jest.fn()).toHaveReturnedWith(expected)

Expected: false
Received: undefined

Number of returns: 1

[Killed] LogicalOperator
src/lib/typeguards/is-next-js-middleware-response.ts:15:10
 export function isNextJsMiddlewareResponse(
   response: IMiddlewareNextResponse | IHttpResponse
 ): response is IMiddlewareNextResponse {
-  return 'cookies' in response && 'set' in response.cookies;
+  return 'cookies' in response || 'set' in response.cookies;
 }
 
killedBy: handleServerCookie should not call handleNextJsMiddlewareCookie or handleHttpCookie when forceServerCookieMode is false
statusReason: TypeError: Cannot use 'in' operator to search for 'set' in undefined

[Killed] ConditionalExpression
src/lib/typeguards/is-next-js-middleware-response.ts:15:10
 export function isNextJsMiddlewareResponse(
   response: IMiddlewareNextResponse | IHttpResponse
 ): response is IMiddlewareNextResponse {
-  return 'cookies' in response && 'set' in response.cookies;
+  return true;
 }
 
killedBy: handleServerCookie should not call handleNextJsMiddlewareCookie or handleHttpCookie when forceServerCookieMode is false
statusReason: TypeError: Cannot read properties of undefined (reading 'then')
