[Killed] BlockStatement
src/lib/validators/is-iso-date-string.ts:2:47
 // © Sitecore Corporation A/S. All rights reserved. Sitecore® is a registered trademark of Sitecore Corporation A/S.
-export function isISODateString(date: string) {
-  try {
-    const convertedDate = new Date(date).toISOString();
-
-    return convertedDate === date;
-  } catch (_) {
-    return false;
-  }
-}
+export function isISODateString(date: string) {}
 
killedBy: isISODateString should return false if the date string is short
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: false
Received: undefined

[Killed] BlockStatement
src/lib/validators/is-iso-date-string.ts:3:7
 // © Sitecore Corporation A/S. All rights reserved. Sitecore® is a registered trademark of Sitecore Corporation A/S.
 export function isISODateString(date: string) {
-  try {
-    const convertedDate = new Date(date).toISOString();
-
-    return convertedDate === date;
-  } catch (_) {
+  try {} catch (_) {
     return false;
   }
killedBy: isISODateString should return false if the date string is short
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: false
Received: undefined

[Killed] ConditionalExpression
src/lib/validators/is-iso-date-string.ts:6:12
   try {
     const convertedDate = new Date(date).toISOString();
 
-    return convertedDate === date;
+    return false;
   } catch (_) {
     return false;
killedBy: isISODateString should return true if the date string is valid and in the correct format
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: true
Received: false

[Killed] EqualityOperator
src/lib/validators/is-iso-date-string.ts:6:12
   try {
     const convertedDate = new Date(date).toISOString();
 
-    return convertedDate === date;
+    return convertedDate !== date;
   } catch (_) {
     return false;
killedBy: isISODateString should return false if the date string is short
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: false
Received: true

[Killed] BlockStatement
src/lib/validators/is-iso-date-string.ts:7:15
     const convertedDate = new Date(date).toISOString();
 
     return convertedDate === date;
-  } catch (_) {
-    return false;
-  }
+  } catch (_) {}
 }
 
killedBy: isISODateString should return false if the date string is empty
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: false
Received: undefined

[Killed] BooleanLiteral
src/lib/validators/is-iso-date-string.ts:8:12
 
     return convertedDate === date;
   } catch (_) {
-    return false;
+    return true;
   }
 }
killedBy: isISODateString should return false if the date string is empty
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: false
Received: true
