[Killed] BlockStatement
src/lib/validators/is-short-iso-date-string.ts:8:52
  * @param date - The date string provided by the developer
  * @returns - A boolean if the string is valid otherwise false
  */
-export function isShortISODateString(date: string) {
-  try {
-    const dateString = date + 'Z';
-    const convertedDate = new Date(dateString).toISOString().substring(0, 16);
-
-    return convertedDate === date;
-  } catch (_) {
-    return false;
-  }
-}
+export function isShortISODateString(date: string) {}
 
killedBy: isShortISODateString should return false if the date string is short
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: false
Received: undefined

[Killed] BlockStatement
src/lib/validators/is-short-iso-date-string.ts:9:7
  * @returns - A boolean if the string is valid otherwise false
  */
 export function isShortISODateString(date: string) {
-  try {
-    const dateString = date + 'Z';
-    const convertedDate = new Date(dateString).toISOString().substring(0, 16);
-
-    return convertedDate === date;
-  } catch (_) {
+  try {} catch (_) {
     return false;
   }
killedBy: isShortISODateString should return false if the date string is short
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: false
Received: undefined

[Killed] StringLiteral
src/lib/validators/is-short-iso-date-string.ts:10:31
  */
 export function isShortISODateString(date: string) {
   try {
-    const dateString = date + 'Z';
+    const dateString = date + "";
     const convertedDate = new Date(dateString).toISOString().substring(0, 16);
 
killedBy: isShortISODateString should return true if the date string is valid and in the correct format
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: true
Received: false

[Killed] MethodExpression
src/lib/validators/is-short-iso-date-string.ts:11:27
 export function isShortISODateString(date: string) {
   try {
     const dateString = date + 'Z';
-    const convertedDate = new Date(dateString).toISOString().substring(0, 16);
+    const convertedDate = new Date(dateString).toISOString();
 
     return convertedDate === date;
killedBy: isShortISODateString should return true if the date string is valid and in the correct format
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: true
Received: false

[Killed] ConditionalExpression
src/lib/validators/is-short-iso-date-string.ts:13:12
     const dateString = date + 'Z';
     const convertedDate = new Date(dateString).toISOString().substring(0, 16);
 
-    return convertedDate === date;
+    return true;
   } catch (_) {
     return false;
killedBy: isShortISODateString should return false if the date string is short
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: false
Received: true
