[Killed] BlockStatement
src/lib/validators/is-valid-email.ts:7:54
  * @param email - the email string to be validated
  * @returns - a boolean value depending on whether the email value passed is valid
  */
-export function isValidEmail(email: string): boolean {
-  const regx = /^[^\s@]+@[^\s@]+\.[^\s@]+$/;
-
-  return regx.test(email);
-}
+export function isValidEmail(email: string): boolean {}
 
killedBy: isValidEmail should return true when valid email strings are passed as parameters
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: true
Received: undefined

[Killed] Regex
src/lib/validators/is-valid-email.ts:8:16
  * @returns - a boolean value depending on whether the email value passed is valid
  */
 export function isValidEmail(email: string): boolean {
-  const regx = /^[^\s@]+@[^\s@]+\.[^\s@]+$/;
+  const regx = /^[^\s@]+@[^\s@]\.[^\s@]+$/;
 
   return regx.test(email);
killedBy: isValidEmail should return true when valid email strings are passed as parameters
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: true
Received: false

[Killed] Regex
src/lib/validators/is-valid-email.ts:8:16
  * @returns - a boolean value depending on whether the email value passed is valid
  */
 export function isValidEmail(email: string): boolean {
-  const regx = /^[^\s@]+@[^\s@]+\.[^\s@]+$/;
+  const regx = /^[^\s@]+@[^\s@]+\.[^\s@]$/;
 
   return regx.test(email);
killedBy: isValidEmail should return true when valid email strings are passed as parameters
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: true
Received: false
