[Killed] BooleanLiteral
engage-utils/src/lib/fetch-with-timeout.ts:19:7
     [key: string]: unknown;
   }
 ): Promise<null | unknown> {
-  if (!Number.isInteger(timeout) || timeout <= 0)
+  if (Number.isInteger(timeout) || timeout <= 0)
     throw new Error(
       '[IV-0006] Incorrect value for the timeout parameter. Set the value to an integer greater than or equal to 0.'
statusReason: Error: [IV-0006] Incorrect value for the timeout parameter. Set the value to an integer greater than or equal to 0.

[Killed] ConditionalExpression
engage-utils/src/lib/fetch-with-timeout.ts:19:37
     [key: string]: unknown;
   }
 ): Promise<null | unknown> {
-  if (!Number.isInteger(timeout) || timeout <= 0)
+  if (!Number.isInteger(timeout) || false)
     throw new Error(
       '[IV-0006] Incorrect value for the timeout parameter. Set the value to an integer greater than or equal to 0.'
statusReason: TypeError: abortController.abort is not a function

[Killed] StringLiteral
engage-utils/src/lib/fetch-with-timeout.ts:21:7
 ): Promise<null | unknown> {
   if (!Number.isInteger(timeout) || timeout <= 0)
     throw new Error(
-      '[IV-0006] Incorrect value for the timeout parameter. Set the value to an integer greater than or equal to 0.'
+      ""
     );
 
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected substring: "[IV-0006] Incorrect value for the timeout parameter. Set the value to an integer greater than or equal to 0."
Received message:   ""

      63 |   } else {
      64 |     stryCov_9fa48("87");

[Killed] BlockStatement
engage-utils/src/lib/fetch-with-timeout.ts:27:43
   const abortController = new AbortController();
   const signal = abortController.signal;
 
-  const timeoutHandler = setTimeout(() => {
-    abortController.abort();
-  }, timeout);
+  const timeoutHandler = setTimeout(() => {}, timeout);
 
   return fetch(url, { ...fetchOptions, signal })
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

[Killed] BlockStatement
engage-utils/src/lib/fetch-with-timeout.ts:32:25
   }, timeout);
 
   return fetch(url, { ...fetchOptions, signal })
-    .then((response) => {
-      clearTimeout(timeoutHandler);
-      return response.json();
-    })
+    .then((response) => {})
     .then((data) => data)
     .catch((error) => {
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"ref": "ref"}
Received: undefined

[Killed] ArrowFunction
engage-utils/src/lib/fetch-with-timeout.ts:36:11
       clearTimeout(timeoutHandler);
       return response.json();
     })
-    .then((data) => data)
+    .then(() => undefined)
     .catch((error) => {
       if (error.name === 'AbortError')
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"ref": "ref"}
Received: undefined

[Killed] StringLiteral
engage-utils/src/lib/fetch-with-timeout.ts:39:23
     .then((data) => data)
     .catch((error) => {
       if (error.name === 'AbortError')
-        throw new Error('[IE-0003] Timeout exceeded. The server did not respond within the allotted time.');
+        throw new Erro"".');
 
       return null;
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "[IE-0003] Timeout exceeded. The server did not respond within the allotted time."
Received: ""
