[Killed] BlockStatement
src/lib/cookie/get-browser-id-from-middleware-request.ts:15:100
  * @param cookieName - The name of the cookie to retrieve.
  * @returns The browser ID extracted from the cookie, or undefined if not found.
  */
-export function getBrowserIdFromMiddlewareRequest(request: IMiddlewareRequest, cookieName: string) {
-  const cookieValueFromRequest: ICookie | string | undefined = request.cookies.get(cookieName);
-  // It checks nextjs v12 cookie values
-  if (typeof cookieValueFromRequest === 'string') return cookieValueFromRequest;
-  // It checks nextjs v13 cookie values
-  if (typeof cookieValueFromRequest === 'object') return cookieValueFromRequest.value;
-
-  return undefined;
-}
+export function getBrowserIdFromMiddlewareRequest(request: IMiddlewareRequest, cookieName: string) {}
 
killedBy: getBrowserIdFromMiddlewareRequest should return browser ID when found in Next.js v12 cookie format
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "your-browser-id"
Received: undefined

[Killed] ConditionalExpression
src/lib/cookie/get-browser-id-from-middleware-request.ts:18:7
 export function getBrowserIdFromMiddlewareRequest(request: IMiddlewareRequest, cookieName: string) {
   const cookieValueFromRequest: ICookie | string | undefined = request.cookies.get(cookieName);
   // It checks nextjs v12 cookie values
-  if (typeof cookieValueFromRequest === 'string') return cookieValueFromRequest;
+  if (false) return cookieValueFromRequest;
   // It checks nextjs v13 cookie values
   if (typeof cookieValueFromRequest === 'object') return cookieValueFromRequest.value;
killedBy: getBrowserIdFromMiddlewareRequest should return browser ID when found in Next.js v12 cookie format
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "your-browser-id"
Received: undefined

[Killed] EqualityOperator
src/lib/cookie/get-browser-id-from-middleware-request.ts:18:7
 export function getBrowserIdFromMiddlewareRequest(request: IMiddlewareRequest, cookieName: string) {
   const cookieValueFromRequest: ICookie | string | undefined = request.cookies.get(cookieName);
   // It checks nextjs v12 cookie values
-  if (typeof cookieValueFromRequest === 'string') return cookieValueFromRequest;
+  if (typeof cookieValueFromRequest !== 'string') return cookieValueFromRequest;
   // It checks nextjs v13 cookie values
   if (typeof cookieValueFromRequest === 'object') return cookieValueFromRequest.value;
killedBy: getBrowserIdFromMiddlewareRequest should return browser ID when found in Next.js v12 cookie format
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "your-browser-id"
Received: undefined

[Killed] ConditionalExpression
src/lib/cookie/get-browser-id-from-middleware-request.ts:20:7
   // It checks nextjs v12 cookie values
   if (typeof cookieValueFromRequest === 'string') return cookieValueFromRequest;
   // It checks nextjs v13 cookie values
-  if (typeof cookieValueFromRequest === 'object') return cookieValueFromRequest.value;
+  if (true) return cookieValueFromRequest.value;
 
   return undefined;
killedBy: getBrowserIdFromMiddlewareRequest should return undefined when browser ID is not found
statusReason: TypeError: Cannot read properties of undefined (reading 'value')

[Killed] EqualityOperator
src/lib/cookie/get-browser-id-from-middleware-request.ts:20:7
   // It checks nextjs v12 cookie values
   if (typeof cookieValueFromRequest === 'string') return cookieValueFromRequest;
   // It checks nextjs v13 cookie values
-  if (typeof cookieValueFromRequest === 'object') return cookieValueFromRequest.value;
+  if (typeof cookieValueFromRequest !== 'object') return cookieValueFromRequest.value;
 
   return undefined;
killedBy: getBrowserIdFromMiddlewareRequest should return browser ID when found in Next.js v13 cookie format
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "your-browser-id"
Received: undefined
