[Killed] ObjectLiteral
src/lib/cookie/get-default-cookie-attributes.ts:16:10
   maxAge: number = DEFAULT_COOKIE_EXPIRY_DAYS,
   cookieDomain?: string
 ): ICookieProperties {
-  return {
-    domain: cookieDomain,
-    maxAge: maxAge * DAILY_SECONDS,
-    path: '/',
-    sameSite: SameSiteProperties.None,
-    secure: true,
-  };
+  return {};
 }
 
killedBy: getDefaultCookieAttributes should return an object with the correct values when max age is provided
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 7
+ Received  + 1

- Object {
-   "domain": undefined,
-   "maxAge": 864000,

[Killed] ArithmeticOperator
src/lib/cookie/get-default-cookie-attributes.ts:18:13
 ): ICookieProperties {
   return {
     domain: cookieDomain,
-    maxAge: maxAge * DAILY_SECONDS,
+    maxAge: maxAge / DAILY_SECONDS,
     path: '/',
     sameSite: SameSiteProperties.None,
killedBy: getDefaultCookieAttributes should return an object with the correct values when max age is provided
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
    "domain": undefined,
-   "maxAge": 864000,

[Killed] BooleanLiteral
src/lib/cookie/get-default-cookie-attributes.ts:21:13
     maxAge: maxAge * DAILY_SECONDS,
     path: '/',
     sameSite: SameSiteProperties.None,
-    secure: true,
+    secure: false,
   };
 }
killedBy: getDefaultCookieAttributes should return an object with the correct values when max age is provided
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
    "domain": undefined,
    "maxAge": 864000,
