[Killed] ArithmeticOperator
src/lib/cookie/handle-http-cookie.ts:26:22
   options: ISettings,
   timeout?: number
 ) {
-  const cookieName = BID_PREFIX + options.clientKey;
+  const cookieName = BID_PREFIX - options.clientKey;
   const cookieValueFromRequest = request.headers.cookie;
 
killedBy: httpCookieHandler should handle the browser ID cookie in the request and response when the cookie is present
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "bid_key=123456789", "bid_key"
Received: "bid_key=123456789", NaN

Number of calls: 1

[Killed] ConditionalExpression
src/lib/cookie/handle-http-cookie.ts:32:7
   let cookie;
   let cookieValue;
 
-  if (cookieValueFromRequest) {
+  if (false) {
     cookie = getCookieServerSide(cookieValueFromRequest, cookieName);
     if (cookie) cookieValue = cookie.value;
killedBy: handleServerCookie should call handleHttpCookie when request is an HTTP Request
statusReason: TypeError: Cannot read properties of undefined (reading 'then')

[Killed] ConditionalExpression
src/lib/cookie/handle-http-cookie.ts:32:7
   let cookie;
   let cookieValue;
 
-  if (cookieValueFromRequest) {
+  if (true) {
     cookie = getCookieServerSide(cookieValueFromRequest, cookieName);
     if (cookie) cookieValue = cookie.value;
killedBy: httpCookieHandler should handle the browser ID cookie in the request and response when the cookie is not present
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "https://domain", "key", undefined

Number of calls: 0

[Killed] ConditionalExpression
src/lib/cookie/handle-http-cookie.ts:34:9
 
   if (cookieValueFromRequest) {
     cookie = getCookieServerSide(cookieValueFromRequest, cookieName);
-    if (cookie) cookieValue = cookie.value;
+    if (false) cookieValue = cookie.value;
   }
 
killedBy: handleServerCookie should call handleHttpCookie when request is an HTTP Request
statusReason: TypeError: Cannot read properties of undefined (reading 'then')

[Killed] BooleanLiteral
src/lib/cookie/handle-http-cookie.ts:37:7
     if (cookie) cookieValue = cookie.value;
   }
 
-  if (!cookieValue) cookieValue = await getBrowserIdFromCdp(options.targetURL, options.clientKey, timeout);
+  if (cookieValue) cookieValue = await getBrowserIdFromCdp(options.targetURL, options.clientKey, timeout);
 
   if (!cookieValue)
killedBy: handleServerCookie should call handleHttpCookie when request is an HTTP Request
statusReason: TypeError: Cannot read properties of undefined (reading 'then')

[Killed] ConditionalExpression
src/lib/cookie/handle-http-cookie.ts:37:7
     if (cookie) cookieValue = cookie.value;
   }
 
-  if (!cookieValue) cookieValue = await getBrowserIdFromCdp(options.targetURL, options.clientKey, timeout);
+  if (false) cookieValue = await getBrowserIdFromCdp(options.targetURL, options.clientKey, timeout);
 
   if (!cookieValue)
killedBy: httpCookieHandler should handle the browser ID cookie in the request and response when the cookie is not present
statusReason: Error: [IE-0004] Unable to set the cookie because the browser ID could not be retrieved from the server. Try again later, or use try-catch blocks to handle this error.

[Killed] ConditionalExpression
src/lib/cookie/handle-http-cookie.ts:39:7
 
   if (!cookieValue) cookieValue = await getBrowserIdFromCdp(options.targetURL, options.clientKey, timeout);
 
-  if (!cookieValue)
+  if (true)
     throw new Error(
       '[IE-0004] Unable to set the cookie because the browser ID could not be retrieved from the server. Try again later, or use try-catch blocks to handle this error.'
killedBy: httpCookieHandler should handle the browser ID cookie in the request and response when the cookie is present
statusReason: Error: [IE-0004] Unable to set the cookie because the browser ID could not be retrieved from the server. Try again later, or use try-catch blocks to handle this error.

[Killed] ConditionalExpression
src/lib/cookie/handle-http-cookie.ts:51:7
 
   const cookieString = createCookieString(cookieName, cookieValue, defaultCookieAttributes);
 
-  if (!cookie)
+  if (true)
     request.headers.cookie = cookieValueFromRequest ? cookieValueFromRequest + '; ' + cookieString : cookieString;
 
killedBy: httpCookieHandler should handle the browser ID cookie in the request and response when the cookie is present
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "bid_key=123456789; bid_key=123456789", "bid_key"
Received: "bid_key=123456789", "bid_key"

Number of calls: 1

[Killed] ConditionalExpression
src/lib/cookie/handle-http-cookie.ts:51:7
 
   const cookieString = createCookieString(cookieName, cookieValue, defaultCookieAttributes);
 
-  if (!cookie)
+  if (false)
     request.headers.cookie = cookieValueFromRequest ? cookieValueFromRequest + '; ' + cookieString : cookieString;
 
killedBy: httpCookieHandler should handle the browser ID cookie in the request and response when the cookie is not present
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "bid_key=mock_bid_key_from_cdp"
Received: undefined
