[Timeout] BlockStatement
src/lib/cookie/handle-next-js-middleware-cookie.ts:29:3
   response: IMiddlewareNextResponse,
   options: ISettings,
   timeout?: number
-) {
-  const cookieName = BID_PREFIX + options.clientKey;
-
-  const cookieValue =
-    getBrowserIdFromMiddlewareRequest(request, cookieName) ??
-    (await getBrowserIdFromCdp(options.targetURL, options.clientKey, timeout));
-
-  if (!cookieValue)
-    throw new Error(
-      '[IE-0004] Unable to set the cookie because the browser ID could not be retrieved from the server. Try again later, or use try-catch blocks to handle this error.'
-    );
-
-  const defaultCookieAttributes = getDefaultCookieAttributes(
-    options.cookieSettings.cookieExpiryDays,
-    options.cookieSettings.cookieDomain
-  );
-  request.cookies.set(cookieName, cookieValue, defaultCookieAttributes);
-  response.cookies.set(cookieName, cookieValue, defaultCookieAttributes);
-}
+) {}
 

[Killed] LogicalOperator
src/lib/cookie/handle-next-js-middleware-cookie.ts:33:5
   const cookieName = BID_PREFIX + options.clientKey;
 
   const cookieValue =
-    getBrowserIdFromMiddlewareRequest(request, cookieName) ??
-    (await getBrowserIdFromCdp(options.targetURL, options.clientKey, timeout));
+    getBrowserIdFromMiddlewareRequest(request, cookieName) && (await getBrowserIdFromCdp(options.targetURL, options.clientKey, timeout));
 
   if (!cookieValue)
killedBy: handleServerCookie should call handleNextJsMiddlewareCookie when request is a isNextJsMiddlewareRequest
statusReason: Error: [IE-0004] Unable to set the cookie because the browser ID could not be retrieved from the server. Try again later, or use try-catch blocks to handle this error.

[Timeout] ConditionalExpression
src/lib/cookie/handle-next-js-middleware-cookie.ts:36:7
     getBrowserIdFromMiddlewareRequest(request, cookieName) ??
     (await getBrowserIdFromCdp(options.targetURL, options.clientKey, timeout));
 
-  if (!cookieValue)
+  if (false)
     throw new Error(
       '[IE-0004] Unable to set the cookie because the browser ID could not be retrieved from the server. Try again later, or use try-catch blocks to handle this error.'
