[Killed] BlockStatement
src/lib/cookie/handle-server-cookie.ts:21:18
   response: X,
   options: ISettings,
   timeout?: number
-): Promise<void> {
-  if (isNextJsMiddlewareRequest(request) && isNextJsMiddlewareResponse(response)) {
-    await handleNextJsMiddlewareCookie(request, response, options, timeout);
-  } else if (isHttpRequest(request) && isHttpResponse(response)) {
-    await handleHttpCookie(request, response, options, timeout);
-  }
-}
+): Promise<void> {}
 
killedBy: handleServerCookie should call handleNextJsMiddlewareCookie when request is a isNextJsMiddlewareRequest
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)


Number of calls: 0

[Killed] ConditionalExpression
src/lib/cookie/handle-server-cookie.ts:22:7
   options: ISettings,
   timeout?: number
 ): Promise<void> {
-  if (isNextJsMiddlewareRequest(request) && isNextJsMiddlewareResponse(response)) {
+  if (false) {
     await handleNextJsMiddlewareCookie(request, response, options, timeout);
   } else if (isHttpRequest(request) && isHttpResponse(response)) {
killedBy: handleServerCookie should call handleNextJsMiddlewareCookie when request is a isNextJsMiddlewareRequest
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)


Number of calls: 0

[Killed] ConditionalExpression
src/lib/cookie/handle-server-cookie.ts:22:7
   options: ISettings,
   timeout?: number
 ): Promise<void> {
-  if (isNextJsMiddlewareRequest(request) && isNextJsMiddlewareResponse(response)) {
+  if (true) {
     await handleNextJsMiddlewareCookie(request, response, options, timeout);
   } else if (isHttpRequest(request) && isHttpResponse(response)) {
killedBy: handleServerCookie should call handleNextJsMiddlewareCookie when request is a isNextJsMiddlewareRequest
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

[Killed] LogicalOperator
src/lib/cookie/handle-server-cookie.ts:24:14
 ): Promise<void> {
   if (isNextJsMiddlewareRequest(request) && isNextJsMiddlewareResponse(response)) {
     await handleNextJsMiddlewareCookie(request, response, options, timeout);
-  } else if (isHttpRequest(request) && isHttpResponse(response)) {
+  } else if (isHttpRequest(request) || isHttpResponse(response)) {
     await handleHttpCookie(request, response, options, timeout);
   }
killedBy: handleServerCookie should not call handleNextJsMiddlewareCookie or handleHttpCookie when forceServerCookieMode is false
statusReason: TypeError: Cannot read properties of undefined (reading 'then')

[Killed] BlockStatement
src/lib/cookie/handle-server-cookie.ts:24:66
 ): Promise<void> {
   if (isNextJsMiddlewareRequest(request) && isNextJsMiddlewareResponse(response)) {
     await handleNextJsMiddlewareCookie(request, response, options, timeout);
-  } else if (isHttpRequest(request) && isHttpResponse(response)) {
-    await handleHttpCookie(request, response, options, timeout);
-  }
+  } else if (isHttpRequest(request) && isHttpResponse(response)) {}
 }
 
killedBy: handleServerCookie should call handleHttpCookie when request is an HTTP Request
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)


Number of calls: 0
