[Timeout] BlockStatement
src/lib/init/generate-browser-id-url.ts:11:90
  * @param clientKey - From global settings
  * @returns The URL string for retrieving the browser ID
  */
-export function generateCreateBrowserIdUrl(targetURL: string, clientKey: string): string {
-  // eslint-disable-next-line max-len
-  return `${targetURL}/${API_VERSION}/browser/create.json?client_key=${clientKey}&message={}`;
-}
+export function generateCreateBrowserIdUrl(targetURL: string, clientKey: string): string {}
 
