[Timeout] BlockStatement
src/lib/init/get-browser-id-from-cdp.ts:14:116
  * @param clientKey - From global settings
  * @returns the browser ID
  */
-export async function getBrowserIdFromCdp(targetURL: string, clientKey: string, timeout?: number): Promise<string> {
-  const fetchOptions = {
-    // eslint-disable-next-line @typescript-eslint/naming-convention
-    headers: { 'X-Library-Version': LIBRARY_VERSION },
-  };
-
-  let response;
-  if (timeout !== undefined) {
-    response = await fetchWithTimeout(generateCreateBrowserIdUrl(targetURL, clientKey), timeout, fetchOptions);
-  } else {
-    response = await fetch(generateCreateBrowserIdUrl(targetURL, clientKey), fetchOptions)
-      .then((res) => res.json())
-      .then((data) => data)
-      .catch(() => undefined);
-  }
-
-  if (!response) return '';
-  const { ref }: ICdpResponse = response;
-  return ref;
-}
+export async function getBrowserIdFromCdp(targetURL: string, clientKey: string, timeout?: number): Promise<string> {}
 

[Killed] ConditionalExpression
src/lib/init/get-browser-id-from-cdp.ts:21:7
   };
 
   let response;
-  if (timeout !== undefined) {
+  if (false) {
     response = await fetchWithTimeout(generateCreateBrowserIdUrl(targetURL, clientKey), timeout, fetchOptions);
   } else {
killedBy: getBrowserIdFromCdp should resolve with an appropriate response object when calling fetch with timeout
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Timeout] EqualityOperator
src/lib/init/get-browser-id-from-cdp.ts:21:7
   };
 
   let response;
-  if (timeout !== undefined) {
+  if (timeout === undefined) {
     response = await fetchWithTimeout(generateCreateBrowserIdUrl(targetURL, clientKey), timeout, fetchOptions);
   } else {
