[Killed] BlockStatement
src/lib/init/get-browser-id.ts:9:50
  * @param cookieName - The cookie name from global settings
  * @returns The browser ID if the cookie exists
  */
-export function getBrowserId(cookieName: string) {
-  return getCookieValueClientSide(cookieName);
-}
+export function getBrowserId(cookieName: string) {}
 
killedBy: getBrowserId should return the cookie value when cookie exists on the page 
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "cookieValue"
Received: undefined
