[Killed] StringLiteral
src/lib/init/get-guest-id.ts:15:15
  */
 export async function getGuestId(browserId: string, targetURL: string, clientKey: string): Promise<string> {
   // eslint-disable-next-line max-len
-  const url = `${targetURL}/${API_VERSION}/browser/${browserId}/show.json?client_key=${clientKey}&api_token=${clientKey}`;
+  const url = ``;
   // eslint-disable-next-line @typescript-eslint/naming-convention
   const response = await fetch(url, { headers: { 'X-Library-Version': LIBRARY_VERSION } });
killedBy: getGuestId should call fetch with the correct url
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- "https://test_url.com/v1.2/browser/bid/show.json?client_key=client_key&api_token=client_key",
+ "",
  {"headers": {"X-Library-Version": "0.0.1"}},
