[Killed] ConditionalExpression
src/lib/settings/create-settings.ts:29:25
     clientKey: clientKey,
     cookieSettings: {
       cookieDomain,
-      cookieExpiryDays: cookieExpiryDays || DEFAULT_COOKIE_EXPIRY_DAYS,
+      cookieExpiryDays: false,
       cookieName: `${BID_PREFIX}${clientKey}`,
       cookiePath: cookiePath || '/',
killedBy: createSettings should store all provided settings
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 40
Received: false

[Killed] ConditionalExpression
src/lib/settings/create-settings.ts:29:25
     clientKey: clientKey,
     cookieSettings: {
       cookieDomain,
-      cookieExpiryDays: cookieExpiryDays || DEFAULT_COOKIE_EXPIRY_DAYS,
+      cookieExpiryDays: true,
       cookieName: `${BID_PREFIX}${clientKey}`,
       cookiePath: cookiePath || '/',
killedBy: createSettings should store all provided settings
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 40
Received: true

[Killed] ConditionalExpression
src/lib/settings/create-settings.ts:31:19
       cookieDomain,
       cookieExpiryDays: cookieExpiryDays || DEFAULT_COOKIE_EXPIRY_DAYS,
       cookieName: `${BID_PREFIX}${clientKey}`,
-      cookiePath: cookiePath || '/',
+      cookiePath: true,
       forceServerCookieMode: forceServerCookieMode ?? false,
     },
killedBy: createSettings should store all provided settings
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "/path"
Received: true

[Killed] LogicalOperator
src/lib/settings/create-settings.ts:31:19
       cookieDomain,
       cookieExpiryDays: cookieExpiryDays || DEFAULT_COOKIE_EXPIRY_DAYS,
       cookieName: `${BID_PREFIX}${clientKey}`,
-      cookiePath: cookiePath || '/',
+      cookiePath: cookiePath && '/',
       forceServerCookieMode: forceServerCookieMode ?? false,
     },
killedBy: createSettings should store all provided settings
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "/path"
Received: "/"

[Killed] BooleanLiteral
src/lib/settings/create-settings.ts:32:55
       cookieExpiryDays: cookieExpiryDays || DEFAULT_COOKIE_EXPIRY_DAYS,
       cookieName: `${BID_PREFIX}${clientKey}`,
       cookiePath: cookiePath || '/',
-      forceServerCookieMode: forceServerCookieMode ?? false,
+      forceServerCookieMode: forceServerCookieMode ?? true,
     },
     includeUTMParameters: includeUTMParameters ?? true,
killedBy: createSettings should hold default values for optional settings
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: false
Received: true

[Killed] LogicalOperator
src/lib/settings/create-settings.ts:32:30
       cookieExpiryDays: cookieExpiryDays || DEFAULT_COOKIE_EXPIRY_DAYS,
       cookieName: `${BID_PREFIX}${clientKey}`,
       cookiePath: cookiePath || '/',
-      forceServerCookieMode: forceServerCookieMode ?? false,
+      forceServerCookieMode: forceServerCookieMode && false,
     },
     includeUTMParameters: includeUTMParameters ?? true,
killedBy: createSettings should store all provided settings
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: true
Received: false

[Killed] LogicalOperator
src/lib/settings/create-settings.ts:34:27
       cookiePath: cookiePath || '/',
       forceServerCookieMode: forceServerCookieMode ?? false,
     },
-    includeUTMParameters: includeUTMParameters ?? true,
+    includeUTMParameters: includeUTMParameters && true,
     pointOfSale: pointOfSale ?? undefined,
     targetURL: targetURL,
killedBy: createSettings should hold default values for optional settings
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: true
Received: undefined

[Killed] BooleanLiteral
src/lib/settings/create-settings.ts:34:51
       cookiePath: cookiePath || '/',
       forceServerCookieMode: forceServerCookieMode ?? false,
     },
-    includeUTMParameters: includeUTMParameters ?? true,
+    includeUTMParameters: includeUTMParameters ?? false,
     pointOfSale: pointOfSale ?? undefined,
     targetURL: targetURL,
killedBy: createSettings should hold default values for optional settings
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: true
Received: false

[Killed] LogicalOperator
src/lib/settings/create-settings.ts:35:18
       forceServerCookieMode: forceServerCookieMode ?? false,
     },
     includeUTMParameters: includeUTMParameters ?? true,
-    pointOfSale: pointOfSale ?? undefined,
+    pointOfSale: pointOfSale && undefined,
     targetURL: targetURL,
   };
killedBy: createSettings should store all provided settings
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "spinair.com"
Received: undefined
