[Killed] BlockStatement
src/lib/settings/update-point-of-sale.ts:8:120
 /**
  * A function that updates Point of sale in init settings object and in the Window.Engage object
  */
-export function updatePointOfSale(pointOfSale: string, settings: ISettingsParamsBrowser | ISettingsParamsServer): void {
-  if (pointOfSale && pointOfSale.trim().length > 0) {
-    if (window && window['Engage'] && window['Engage'].settings) {
-      // eslint-disable-next-line @typescript-eslint/naming-convention
-      window['Engage'].settings.pointOfSale = pointOfSale;
-    }
-    settings.pointOfSale = pointOfSale;
-  } else {
-    throw new Error('[MV-0009] "pointOfSale" cannot be empty.');
-  }
-}
+export function updatePointOfSale(pointOfSale: string, settings: ISettingsParamsBrowser | ISettingsParamsServer): void {}
 
killedBy: updatePointOfSale should update point of sale with the new value
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "spinair.com"
Received: undefined

[Killed] EqualityOperator
src/lib/settings/update-point-of-sale.ts:9:22
  * A function that updates Point of sale in init settings object and in the Window.Engage object
  */
 export function updatePointOfSale(pointOfSale: string, settings: ISettingsParamsBrowser | ISettingsParamsServer): void {
-  if (pointOfSale && pointOfSale.trim().length > 0) {
+  if (pointOfSale && pointOfSale.trim().length >= 0) {
     if (window && window['Engage'] && window['Engage'].settings) {
       // eslint-disable-next-line @typescript-eslint/naming-convention
killedBy: updatePointOfSale should throw error when providing empty space string
statusReason: Error: expect(received).toThrowError(expected)

Expected substring: "[MV-0009] \"pointOfSale\" cannot be empty."

Received function did not throw

[Killed] LogicalOperator
src/lib/settings/update-point-of-sale.ts:9:7
  * A function that updates Point of sale in init settings object and in the Window.Engage object
  */
 export function updatePointOfSale(pointOfSale: string, settings: ISettingsParamsBrowser | ISettingsParamsServer): void {
-  if (pointOfSale && pointOfSale.trim().length > 0) {
+  if (pointOfSale || pointOfSale.trim().length > 0) {
     if (window && window['Engage'] && window['Engage'].settings) {
       // eslint-disable-next-line @typescript-eslint/naming-convention
killedBy: updatePointOfSale should throw error when providing empty space string
statusReason: Error: expect(received).toThrowError(expected)

Expected substring: "[MV-0009] \"pointOfSale\" cannot be empty."

Received function did not throw

[Killed] LogicalOperator
src/lib/settings/update-point-of-sale.ts:10:9
  */
 export function updatePointOfSale(pointOfSale: string, settings: ISettingsParamsBrowser | ISettingsParamsServer): void {
   if (pointOfSale && pointOfSale.trim().length > 0) {
-    if (window && window['Engage'] && window['Engage'].settings) {
+    if (window || window['Engage'] && window['Engage'].settings) {
       // eslint-disable-next-line @typescript-eslint/naming-convention
       window['Engage'].settings.pointOfSale = pointOfSale;
killedBy: updatePointOfSale should update point of sale with the new value
statusReason: TypeError: Cannot read properties of undefined (reading 'settings')

[Killed] BlockStatement
src/lib/settings/update-point-of-sale.ts:10:66
  */
 export function updatePointOfSale(pointOfSale: string, settings: ISettingsParamsBrowser | ISettingsParamsServer): void {
   if (pointOfSale && pointOfSale.trim().length > 0) {
-    if (window && window['Engage'] && window['Engage'].settings) {
-      // eslint-disable-next-line @typescript-eslint/naming-convention
-      window['Engage'].settings.pointOfSale = pointOfSale;
-    }
+    if (window && window['Engage'] && window['Engage'].settings) {}
     settings.pointOfSale = pointOfSale;
   } else {
killedBy: updatePointOfSale should update point of sale with the new value in settings and in global window when exists
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "spinair.com"
Received: ""

[Killed] BlockStatement
src/lib/settings/update-point-of-sale.ts:15:10
       window['Engage'].settings.pointOfSale = pointOfSale;
     }
     settings.pointOfSale = pointOfSale;
-  } else {
-    throw new Error('[MV-0009] "pointOfSale" cannot be empty.');
-  }
+  } else {}
 }
 
killedBy: updatePointOfSale should throw error when providing empty string
statusReason: Error: expect(received).toThrowError(expected)

Expected substring: "[MV-0009] \"pointOfSale\" cannot be empty."

Received function did not throw

[Killed] StringLiteral
src/lib/settings/update-point-of-sale.ts:16:21
     }
     settings.pointOfSale = pointOfSale;
   } else {
-    throw new Error('[MV-0009] "pointOfSale" cannot be empty.');
+    throw new Error("");
   }
 }
killedBy: updatePointOfSale should throw error when providing empty string
statusReason: Error: expect(received).toThrowError(expected)

Expected substring: "[MV-0009] \"pointOfSale\" cannot be empty."
Received message:   ""

      78 |       } else {
      79 |         stryCov_9fa48("112");
    > 80 |         throw new Error(stryMutAct_9fa48("113") ? "" : (stryCov_9fa48("113"), '[MV-0009] "pointOfSale" cannot be empty.'));
