[Killed] BlockStatement
src/lib/settings/validate-settings.ts:8:92
 /**
  * A validation function for the required global settings
  */
-export function validateSettings(settings: ISettingsParamsBrowser | ISettingsParamsServer) {
-  const { clientKey, targetURL, pointOfSale } = settings;
-
-  if (!clientKey) throw new Error(`[MV-0001] "clientKey" is required.`);
-
-  if (!targetURL) throw new Error(`[MV-0002] "targetURL" is required.`);
-
-  if (pointOfSale && pointOfSale.trim().length === 0) throw new Error('[MV-0009] "pointOfSale" cannot be empty.');
-
-  try {
-    new URL(targetURL);
-  } catch (e) {
-    throw new Error(`[IV-0001] Incorrect value for "targetURL". Set the value to a valid URL string.`);
-  }
-}
+export function validateSettings(settings: ISettingsParamsBrowser | ISettingsParamsServer) {}
 
killedBy: validateSettings should throw errors when provided mandatory settings with falsy values
statusReason: Error: expect(received).toThrowError(expected)

Expected substring: "[MV-0001] \"clientKey\" is required."

Received function did not throw

[Killed] BooleanLiteral
src/lib/settings/validate-settings.ts:11:7
 export function validateSettings(settings: ISettingsParamsBrowser | ISettingsParamsServer) {
   const { clientKey, targetURL, pointOfSale } = settings;
 
-  if (!clientKey) throw new Error(`[MV-0001] "clientKey" is required.`);
+  if (clientKey) throw new Error(`[MV-0001] "clientKey" is required.`);
 
   if (!targetURL) throw new Error(`[MV-0002] "targetURL" is required.`);
killedBy: createSettings should store all provided settings
statusReason: Error: [MV-0001] "clientKey" is required.

[Killed] ConditionalExpression
src/lib/settings/validate-settings.ts:11:7
 export function validateSettings(settings: ISettingsParamsBrowser | ISettingsParamsServer) {
   const { clientKey, targetURL, pointOfSale } = settings;
 
-  if (!clientKey) throw new Error(`[MV-0001] "clientKey" is required.`);
+  if (false) throw new Error(`[MV-0001] "clientKey" is required.`);
 
   if (!targetURL) throw new Error(`[MV-0002] "targetURL" is required.`);
killedBy: validateSettings should throw errors when provided mandatory settings with falsy values
statusReason: Error: expect(received).toThrowError(expected)

Expected substring: "[MV-0001] \"clientKey\" is required."
Received message:   "[MV-0002] \"targetURL\" is required."

      63 |     } = settings;
      64 |     if (stryMutAct_9fa48("117") ? false : stryMutAct_9fa48("116") ? true : stryMutAct_9fa48("115") ? clientKey : (stryCov_9fa48("115", "116", "117"), !clientKey)) throw new Error(stryMutAct_9fa

[Killed] ConditionalExpression
src/lib/settings/validate-settings.ts:13:7
 
   if (!clientKey) throw new Error(`[MV-0001] "clientKey" is required.`);
 
-  if (!targetURL) throw new Error(`[MV-0002] "targetURL" is required.`);
+  if (false) throw new Error(`[MV-0002] "targetURL" is required.`);
 
   if (pointOfSale && pointOfSale.trim().length === 0) throw new Error('[MV-0009] "pointOfSale" cannot be empty.');
killedBy: validateSettings should throw errors when provided mandatory settings with falsy values
statusReason: Error: expect(received).toThrowError(expected)

Expected substring: "[MV-0002] \"targetURL\" is required."
Received message:   "[IV-0001] Incorrect value for \"targetURL\". Set the value to a valid URL string."

      77 |       } else {
      78 |         stryCov_9fa48("131");
    > 79 |         throw new Error(stryMutAct_9fa48("132") ? `` : (stryCov_9fa48("132"), `[IV-0001] Incorrect value for "

[Killed] ConditionalExpression
src/lib/settings/validate-settings.ts:13:7
 
   if (!clientKey) throw new Error(`[MV-0001] "clientKey" is required.`);
 
-  if (!targetURL) throw new Error(`[MV-0002] "targetURL" is required.`);
+  if (true) throw new Error(`[MV-0002] "targetURL" is required.`);
 
   if (pointOfSale && pointOfSale.trim().length === 0) throw new Error('[MV-0009] "pointOfSale" cannot be empty.');
killedBy: createSettings should store all provided settings
statusReason: Error: [MV-0002] "targetURL" is required.

[Killed] MethodExpression
src/lib/settings/validate-settings.ts:15:22
 
   if (!targetURL) throw new Error(`[MV-0002] "targetURL" is required.`);
 
-  if (pointOfSale && pointOfSale.trim().length === 0) throw new Error('[MV-0009] "pointOfSale" cannot be empty.');
+  if (pointOfSale && pointOfSale.length === 0) throw new Error('[MV-0009] "pointOfSale" cannot be empty.');
 
   try {
killedBy: validateSettings should throw errors when provided mandatory settings with falsy values
statusReason: Error: expect(received).toThrowError(expected)

Expected substring: "[MV-0009] \"pointOfSale\" cannot be empty."

Received function did not throw

[Killed] ConditionalExpression
src/lib/settings/validate-settings.ts:15:22
 
   if (!targetURL) throw new Error(`[MV-0002] "targetURL" is required.`);
 
-  if (pointOfSale && pointOfSale.trim().length === 0) throw new Error('[MV-0009] "pointOfSale" cannot be empty.');
+  if (pointOfSale && true) throw new Error('[MV-0009] "pointOfSale" cannot be empty.');
 
   try {
killedBy: createSettings should store all provided settings
statusReason: Error: [MV-0009] "pointOfSale" cannot be empty.

[Killed] BlockStatement
src/lib/settings/validate-settings.ts:17:7
 
   if (pointOfSale && pointOfSale.trim().length === 0) throw new Error('[MV-0009] "pointOfSale" cannot be empty.');
 
-  try {
-    new URL(targetURL);
-  } catch (e) {
+  try {} catch (e) {
     throw new Error(`[IV-0001] Incorrect value for "targetURL". Set the value to a valid URL string.`);
   }
killedBy: validateSettings should throw error when the string provided for targetURL doesn't correspond to a valid url
statusReason: Error: expect(received).toThrowError(expected)

Expected substring: "[IV-0001] Incorrect value for \"targetURL\". Set the value to a valid URL string."

Received function did not throw

[Killed] BlockStatement
src/lib/settings/validate-settings.ts:19:15
 
   try {
     new URL(targetURL);
-  } catch (e) {
-    throw new Error(`[IV-0001] Incorrect value for "targetURL". Set the value to a valid URL string.`);
-  }
+  } catch (e) {}
 }
 
killedBy: validateSettings should throw error when the string provided for targetURL doesn't correspond to a valid url
statusReason: Error: expect(received).toThrowError(expected)

Expected substring: "[IV-0001] Incorrect value for \"targetURL\". Set the value to a valid URL string."

Received function did not throw
